[
{
    "productName": "SO&CO New York Men\'s 5003.1 Monticello Quartz Day and Date Stainless Steel Watch",
    "price": 213,
    "color": "silver",
    "quantity": 119,
    "smallDescription": "Featuring round black dial with trio of subdials, textured bezel, and five-row link bracelet\n Japanese quartz movement with analog display",
    "largeDescription": "SO & CO was born in New York, inspired by the City\'s dynamic effervescent lifestyle. Our constant emphasis on producing fashion-forward designs, drives our commitment to bridging the gap between high-end fashion and affordability. ",
    "smallImage": "http://ecx.images-amazon.com/images/I/51H88Nrhl9L._SY220_.jpg",
    "largeImage": "http://ecx.images-amazon.com/images/I/91mn2fIS1RL._UY741_.jpg"
},
{
    "productName": "Stuhrling Original Men\'s 830.02 Symphony Quartz Tranparent Floating Dial Gold-Tone Rubber Strap Watch",
    "price": 156,
    "color": "golden",
    "quantity": 130,
    "smallDescription": " Round watch with transparent face featuring polished Arabic numerals and beveled, gold-tone bezel\n 42 mm stainless steel case with Krysterna Crystal dial window",
    "largeDescription": "The Stuhrling Symphony 830 delivers a magnificent performance of watchmaking virtuosity. Revel in this harmonious composition of artistry, finesse and grandeur. Its rhythmic and balletic movement offers a calm, yet captivating experience. Lift the curtain on mastery and steal the show. ",
    "smallImage": "http://ecx.images-amazon.com/images/I/51tAt0jCohL._SL260_SX200_CR0,0,200,260_.jpg",
    "largeImage": "http://ecx.images-amazon.com/images/I/91t0MOIYsQL._UY679_.jpg"
},
{
    "productName": "Timex Men\'s TW49999009J Expedition Acadia Black Resin Watch with Nylon Band",
    "price": 100,
    "color": "black",
    "quantity": 32,
    "smallDescription": " Black watch featuring easy-to-read blue dial with date window and Indiglo night-light\n40 mm resin case with acrylic dial window",
    "largeDescription": "A military-inspired twist on our iconic Camper watches, Acadia is a lightweight, classic outdoor utility watch made for the no-frills adventurer. Indiglo night-light illuminates evening escapades and the sealed case is reliably water resistant to 50 meters. ",
    "smallImage": "http://ecx.images-amazon.com/images/I/51Jug3Ye6yL._SL260_SX200_CR0,0,200,260_.jpg",
    "largeImage": "http://ecx.images-amazon.com/images/I/91vY2OCDsPL._UY741_.jpg"
},
{
    "productName": "SO&CO New York Men\'s 5043.2 Madison Silver-Tone Watch with Black Band",
    "price": 200,
    "color": "black",
    "quantity": 62,
    "smallDescription": " Round watch in polished case featuring alternating Arabic and stick hour markers\n 39mm stainless steel case with mineral dial window",
    "largeDescription": "The Madison 5043 was inspired by one of the most iconic avenues in all of New York City. This wrist mate offers a refined look to be worn in confidence, and with their cultured design, we'd expect nothing less. To a lavish corporate event or casual dinner party, a plus one that will command a few double takes. ",
    "smallImage": "http://ecx.images-amazon.com/images/I/41lUuN2VXRL._SL260_SX200_CR0,0,200,260_.jpg",
    "largeImage": "http://ecx.images-amazon.com/images/I/91IbypUnQ7L._UY741_.jpg"
},
{
    "productName": "Timex Men\'s TW2P614009J Main Street Sport Silver-Tone Stainless Steel Watch With Expansion Band",
    "price": 221,
    "color": "silver",
    "quantity": 109,
    "smallDescription": " Round watch in brushed silver tone featuring numbered bezel and white dial with Indiglo and date window\n 42 mm brass case with mineral dial window",
    "largeDescription": "This amazing Fieldstone watch by Timex has a unique style that is sure to catch your eye This timepiece features a silver stainless-steel band that is sure to catch anyones attention and a 42MM stainless steel case that brings it together The white dial helps complete the overall look of the watch This watch is also water resistant up to 50 meters 165 feet 5 atm and has a strong mineral crystal which makes this watch something that will last for a very long time ",
    "smallImage": "http://ecx.images-amazon.com/images/I/51VmxPLLpML._SL260_SX200_CR0,0,200,260_.jpg",
    "largeImage": "http://ecx.images-amazon.com/images/I/81brqLYUlZL._UY679_.jpg"
},
{
    "productName": "Armitron Men\'s 20/4935GNTT Multi-Function Bracelet Watch",
    "price": 221,
    "color": "silver",
    "quantity": 115,
    "smallDescription": " Round watch with silver-tone sunray dial and tonal partial Roman numeral markers, day/date calendar window, luminous hands and squares at each hour at outer track\n 40 mm stainless steel case with mineral dial window",
    "largeDescription": "For over 50 years Armitron® has been offering premium quality and fashionable timepieces at an exceptional value. Our timepieces are constructed from the highest quality materials and undergo rigorous quality control testing to ensure that each model will withstand the test of time.",
    "smallImage": "http://ecx.images-amazon.com/images/I/41Y3o2hTQ3L._SL260_SX200_CR0,0,200,260_.jpg",
    "largeImage": "http://ecx.images-amazon.com/images/I/91vNZZN62AL._UY741_.jpg"
},
{
    "productName": "SO&CO New York Unisex 5103.4 SoHo Quartz Black Denim Leather Band Watch",
    "price": 189,
    "color": "black",
    "quantity": 83,
    "smallDescription": " Gunmetal-tone watch featuring round dial in black denim with logo and stick indices\n 41 mm stainless steel case with mineral dial window",
    "largeDescription": "SO & CO was born in New York, inspired by the City’s dynamic effervescent lifestyle. Our constant emphasis on producing fashion-forward designs, drives our commitment to bridging the gap between high-end fashion and affordability. ",
    "smallImage": "http://ecx.images-amazon.com/images/I/51v5kAKO8SL._SL260_SX200_CR0,0,200,260_.jpg",
    "largeImage": "http://ecx.images-amazon.com/images/I/91ayXBmDckL._UY741_.jpg"
},
{
    "productName": "Breda Men\'s 1682B Gold-Tone Watch with Blue Band",
    "price": 117,
    "color": "brown",
    "quantity": 14,
    "smallDescription": "Round watch with rose gold-tone case featuring blue dial with rose gold-tone hands and white hour markers\n 38 millimeters metal case with mineral dial window",
    "largeDescription": "Our process of creation is our own unique alchemy. A key principle is that of discovery: we live contemporary culture, explore the past and dream up the future, scour the world\'s fashion stages and streets to challenge and inspire each other's imaginations. Then we design.",
    "smallImage": "http://ecx.images-amazon.com/images/I/51sJ0sqX02L._SL260_SX200_CR0,0,200,260_.jpg",
    "largeImage": "http://ecx.images-amazon.com/images/I/91gKV%2Bpwd7L._UY741_.jpg"
},
{
    "productName": "Timex Men\'s T2P2959J Easy Reader Two-Tone Expansion-Bracelet Watch",
    "price": 71,
    "color": "Golden",
    "quantity": 116,
    "smallDescription": "Two-tone bracelet watch featuring easy-to-read dial with Indiglo light and three o'clock date window\n 36 mm brass case with mineral dial window",
    "largeDescription": "The direct descendent of our 1960s televised torture test survivors, today's Easy Reader is as durable as it is classic cool. There's probably more Easy Readers in circulation than any other Timex watch. It's just uncomplicated time telling. ",
    "smallImage": "http://ecx.images-amazon.com/images/I/51qu-SY59KL._AA160_.jpg",
    "largeImage": "http://ecx.images-amazon.com/images/I/81MerukCoYL._UY879_.jpg"
},
{
    "productName": "Timex Men\'s TW2P723009J Weekender Collection Analog Display Quartz Two-Tone Watch",
    "price": 145,
    "color": "grey",
    "quantity": 81,
    "smallDescription": "Round silver-tone watch with white dial, contrast second hand, Indiglo nightlight, and black Arabic numerals listing 24-hour time at inner track\n 38 mm stainless steel case with mineral dial window",
    "largeDescription": "During World War II, Waterbury renamed itself U.S. Time Company. In 1950 the company introduced a wristwatch called the Timex. Over the next three decades, Timex was sold through a series of advertisements which emphasized its durability by putting the watch through \"torture tests,\" such as falling over the Grand Coulee Dam or being strapped to the propeller of an outboard motor, with the slogan \"It takes a licking and keeps on ticking.\" With the help of former Olympic broadcaster, spokesman John Cameron Swayze, sales took off. The company later became Timex Corporation, then Timex Group and, to date, has sold over one billion watches.",
    "smallImage": "http://ecx.images-amazon.com/images/I/519NOgxdBQL._SL260_SX200_CR0,0,200,260_.jpg",
    "largeImage": "http://ecx.images-amazon.com/images/I/91upG3klyZL._UY879_.jpg"
},
{
    "productName": "Timex Unisex TW2P680009J Weekender Varsity Row Analog Display Quartz Red Watch",
    "price": 169,
    "color": "red",
    "quantity": 139,
    "smallDescription": "Round silver-tone watch with white dial, Indiglo nightlight, and black Arabic numerals listing 24-hour time at inner track\n 38 mm stainless steel case with mineral dial window",
    "largeDescription": "The company has remained very competitive and the Timex brand continues its dominance through present day. Its primary market remains the United States and Canada, although the Timex brand is sold worldwide due to its ability to capitalize on its strong brand image and reputation for quality.",
    "smallImage": "http://ecx.images-amazon.com/images/I/516tzlND9VL._SL260_SX200_CR0,0,200,260_.jpg",
    "largeImage": "http://ecx.images-amazon.com/images/I/91sjsks6HGL._UY879_.jpg"
},
  {
    "productName": "Casio Men's A158W-1 Stainless Steel Digital Watch",
    "price": 180,
    "color": "silver",
    "quantity": 122,
    "smallDescription": " Made in USA or Imported\n Stainless steel watch featuring luminous rectangular dial with alarm and stopwatch",
    "largeDescription": "With the launch of its first watch in November 1974, Casio entered the wristwatch market at a time when the watch industry had just discovered digital technology. As a company with cutting-edge electronic technology developed for pocket calculators, Casio entered this field confident that it could develop timepieces that would lead the market.",
    "smallImage": "http://ecx.images-amazon.com/images/I/41Gm-iiOh9L._SY220_.jpg",
    "largeImage": "http://ecx.images-amazon.com/images/I/81UnCGx%2BGpL._UY879_.jpg"
  },
{
    "productName": "SO&CO New York Men's 5042.1 Yacht Club Quartz Date Stainless Steel Watch",
    "price": 152,
    "color": "silver",
    "quantity": 128,
    "smallDescription": " Round watch with black face in stainless steel featuring black bezel and luminous indices and hands\n Japanese quartz movement with analog display",
    "largeDescription": "The Madison 5042 was inspired by the one of the most iconic avenues in all of New York City, the Madison 5042 is stylish and sophisticated as dynamic as the city itself. This wrist mate offer a refined look to be worn in confidence, and with their cultured design, we'd expect nothing less. To a lavish corporate event or casual dinner party, a plus one that will command a few double stares.",
    "smallImage": "http://ecx.images-amazon.com/images/I/51-Yb6gwaKL._SL260_SX200_CR0,0,200,260_.jpg",
    "largeImage": "http://ecx.images-amazon.com/images/I/81Pn456YI3L._UY679_.jpg"
},
{
    "productName": "SO&CO New York Men\'s 5002A.2 SoHo Quartz Black Luminous Dial Black Canvas Watch",
    "price": 85,
    "color": "black",
    "quantity": 40,
    "smallDescription": " Round watch in polished stainless steel with matte black dial featuring printed indices on flange\n Quartz movement with analog display",
    "largeDescription": "SO & CO was born in New York, inspired by the City’s dynamic effervescent lifestyle. Our constant emphasis on producing fashion-forward designs, drives our commitment to bridging the gap between high-end fashion and affordability. ",
    "smallImage": "http://ecx.images-amazon.com/images/I/51GKkeyx2QL._SL260_SX200_CR0,0,200,260_.jpg",
    "largeImage": "http://ecx.images-amazon.com/images/I/91B5yLJPb5L._UY879_.jpg"
},
{
    "productName": "Armitron Men\'s 20/5082SVSV Silver-Tone Bracelet Watch",
    "price": 85,
    "color": "silver",
    "quantity": 40,
    "smallDescription": "Round watch with gray sunray dial, luminous hands and markers, interior printed minutes, and Arabic numerals at ridged outer track\n 40 mm stainless steel case with mineral dial window",
    "largeDescription": "For over 50 years Armitron® has been offering premium quality and fashionable timepieces at an exceptional value. Our timepieces are constructed from the highest quality materials and undergo rigorous quality control testing to ensure that each model will withstand the test of time.",
    "smallImage": "http://ecx.images-amazon.com/images/I/41+ai5iP5SL._SL260_SX200_CR0,0,200,260_.jpg",
    "largeImage": "http://ecx.images-amazon.com/images/I/917a2nYaamL._UY741_.jpg"
},
{
    "productName": "Folio Men\'s ZRT15532S10 Analog Display Quartz Brown Watch",
    "price": 189,
    "color": "brown",
    "quantity": 118,
    "smallDescription": " Watch not suitable for swimming, shower, or any exposure to water\n Sub-dials are non-working and intended for decorative purposes only",
    "largeDescription": "Currently, item can be shipped only within the U.S. and to APO/FPO addresses. For APO\/FPO shipments, please check with the manufacturer regarding warranty and support issues. International Shipping: This item can be shipped to select countries outside of the U.S.",
    "smallImage": "http://ecx.images-amazon.com/images/I/41k-p3bFCvL._SL260_SX200_CR0,0,200,260_.jpg",
    "largeImage": "http://ecx.images-amazon.com/images/I/91mHpSZX2hL._UY879_.jpg"
},
{
    "productName": "Folio Men\'s ZRT15513F9 Analog Display Quartz Grey Watch",
    "price": 173,
    "color": "grey",
    "quantity": 5,
    "smallDescription": " Watch not suitable for swimming, shower, or any exposure to water\n Band width: 20mm",
    "largeDescription": "Currently, item can be shipped only within the U.S. and to APO\/FPO addresses. For APO\/FPO shipments, please check with the manufacturer regarding warranty and support issues.",
    "smallImage": "http://ecx.images-amazon.com/images/I/51XYs-ksWgL._SL260_SX200_CR0,0,200,260_.jpg",
    "largeImage": "http://ecx.images-amazon.com/images/I/91rXfzSuKJL._UY879_.jpg"
},
{
    "productName": "U.S. Polo Assn. Classic Men's USC50177 Analog Display Analog Quartz Brown Watch",
    "price": 125,
    "color": "brown",
    "quantity": 139,
    "smallDescription": " Japanese quartz movement with analog display\n Large gold and luminous Arabic numerals and sticks for easy time read; gold logo and other indicators on brown dial",
    "largeDescription": "This gold-tone brown polyurethane leather men's strap watch is ideal for everyday wear. The stationary diver's bezel design gives this watch a sporty look. It's large gold and luminous Arabic numerals and sticks make it very easy to read the time, especially in the dark. ",
    "smallImage": "http://ecx.images-amazon.com/images/I/51o+yBu7bEL._SL260_SX200_CR0,0,200,260_.jpg",
    "largeImage": "http://ecx.images-amazon.com/images/I/916XsUasBEL._UY741_.jpg"
},
{
    "productName": "Geneva Men\'s FMDJM523 Analog Display Quartz Multi-Color Watch",
    "price": 214,
    "color": "brown",
    "quantity": 99,
    "smallDescription": " Watch not suitable for any exposure to water\n Sub-dials are non-working and intended for decorative purposes only",
    "largeDescription": "Geneva offers a varied collection of watches, featuring timepieces that are classic, innovative, and trend-setting. With so much to choose from, people of all style preferences can find the perfect accessory. ",
    "smallImage": "http://ecx.images-amazon.com/images/I/511-+NtR0BL._SL260_SX200_CR0,0,200,260_.jpg",
    "largeImage": "http://ecx.images-amazon.com/images/I/91VnszupIPL._UY741_.jpg"
},
{
    "productName": "Timex Unisex TW2P683009J Weekender Varsity Row Analog Display Quartz Green Watch",
    "price": 163,
    "color": "green",
    "quantity": 134,
    "smallDescription": "Round silver-tone watch with white dial, Indiglo nightlight, and black Arabic numerals listing 24-hour time at inner track",
    "largeDescription": "One of the most successful and important features available on many Timex watches is the Indiglo backlight system. Indiglo is a brand name of Indiglo Corporation, solely owned by Timex for licensing purposes. Timex electroluminescent lamps, branded Indiglo, were introduced in 1992 in the Ironman watch line. They were an immediate success. The Indiglo lamp uniformly lights the surface of the Timex’s watch dials in a manner that makes the dial read very easily in many different light settings. In some newer watches the Indiglo backlight only lights up the numbers, rather than the entire LCD display, which is achieved by means of a specialized film that inverts the LCD transmissivity.",
    "smallImage": "http://ecx.images-amazon.com/images/I/51dpqewn0wL._SL260_SX200_CR0,0,200,260_.jpg",
    "largeImage": "http://ecx.images-amazon.com/images/I/91dAWbY3BGL._UY879_.jpg"
},
{
    "productName": "SO&CO New York Unisex 5103.3 SoHo Analog Display Japanese Quartz Champagne Watch",
    "price": 200,
    "color": "golden",
    "quantity": 48,
    "smallDescription": " Polished round shaped ultra-slim case with champagne colored denim covered genuine leather strap\n Champagne colored denim design dial with stainless steel applied stick markers",
    "largeDescription": "The SoHo 5103 thrives on its individuality. Influenced by the trendsetting exuberant neighborhood located in Lower Manhattan, these watches are more than fashionable timekeepers. They are personalities. Insignias of originality. Timepieces that exemplify confidence and the moxie to be what you want, when you want. ",
    "smallImage": "http://ecx.images-amazon.com/images/I/51602W-cocL._SL260_SX200_CR0,0,200,260_.jpg",
    "largeImage": "http://ecx.images-amazon.com/images/I/918K0GkNMwL._UY741_.jpg"
},
{
    "productName": "Timex Unisex TW2P678009J Weekender Varsity Row Analog-Display Quartz Blue Watch",
    "price": 221,
    "color": "blue",
    "quantity": 16,
    "smallDescription": " Silver-tone round watch with inset military-time markers and Indiglo lighting\n 38 mm stainless steel case with mineral dial window",
    "largeDescription": "The company has remained very competitive and the Timex brand continues its dominance through present day. Its primary market remains the United States and Canada, although the Timex brand is sold worldwide due to its ability to capitalize on its strong brand image and reputation for quality.",
    "smallImage": "http://ecx.images-amazon.com/images/I/51F5Hd5VUPL._SL260_SX200_CR0,0,200,260_.jpg",
    "largeImage": "http://ecx.images-amazon.com/images/I/91AlEqlXNTL._UY879_.jpg"
},
{
    "productName": "Timex Men\'s TW2P766009J City Collection Gold-Tone Stainless Steel Watch with Brown Genuine Leather Band",
    "price": 139,
    "color": "brown",
    "quantity": 95,
    "smallDescription": " Round gold-tone watch featuring sunray dial with Indiglo nightlight, luminous hands, and military time on inner dial\n39 mm gold-tone stainless steel case with mineral dial window",
    "largeDescription": "Timex Group B.V. is one of the best-known American watch companies. Timex's U.S. headquarters are located in Middlebury Connecticut and it has substantial operations in China, the Philippines and India and full scale sales companies in Canada, the UK, France and Mexico.",
    "smallImage": "http://ecx.images-amazon.com/images/I/51p6PCL1eiL._SL260_SX200_CR0,0,200,260_.jpg",
    "largeImage": "http://ecx.images-amazon.com/images/I/91Y99AORiIL._UY741_.jpg"
},
{
    "productName": "Timex Men\'s TW49998009J Expedition Acadia Watch with Black Nylon Band",
    "price": 212,
    "color": "brown",
    "quantity": 126,
    "smallDescription": " Round watch with green case featuring 24-hour display on inner dial, date window at 3 o'clock, and Indiglo night light\n40 mm resin case with acrylic dial window",
    "largeDescription": "A military-inspired twist on our iconic Camper watches, Acadia is a lightweight, classic outdoor utility watch made for the no-frills adventurer. Indiglo night-light illuminates evening escapades and the sealed case is reliably water resistant to 50 meters. ",
    "smallImage": "http://ecx.images-amazon.com/images/I/51fcHX2OXHL._SL260_SX200_CR0,0,200,260_.jpg",
    "largeImage": "http://ecx.images-amazon.com/images/I/91QtyUjfyYL._UY679_.jpg"
},
{
    "productName": "U.S. Polo Assn. Classic Men's USC80296 Analog Display Analog Quartz Silver Watch",
    "price": 232,
    "color": "silver",
    "quantity": 131,
    "smallDescription": " Round watch with tonal sunray dial featuring logo at six o\'clock and Arabic numerals at cardinal positions\n 47 mm metal case with glass dial window",
    "largeDescription": "",
    "smallImage": "The U.S. Polo Association time wear collection consists of updated classic timepieces geared for a more fashion conscious consumer. The watches are designed with larger cases, special plating and sporty leather, rubber or metal bands to create a fresh look in the market place.",
    "largeImage": "http://ecx.images-amazon.com/images/I/91mM7wLEpnL._UY679_.jpg"
}
]